SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32SG23/Include/efr32sg23_keyscan.h
/**************************************************************************//**
 * @file
 * @brief EFR32SG23 KEYSCAN register and bit field definitions
 ******************************************************************************
 * # License
 * <b>Copyright 2023 Silicon Laboratories, Inc. www.silabs.com</b>
 ******************************************************************************
 *
 * SPDX-License-Identifier: Zlib
 * 
 * The licensor of this software is Silicon Laboratories Inc.
 * 
 * This software is provided 'as-is', without any express or implied
 * warranty. In no event will the authors be held liable for any damages
 * arising from the use of this software.
 * 
 * Permission is granted to anyone to use this software for any purpose,
 * including commercial applications, and to alter it and redistribute it
 * freely, subject to the following restrictions:
 * 
 * 1. The origin of this software must not be misrepresented; you must not
 *    claim that you wrote the original software. If you use this software
 *    in a product, an acknowledgment in the product documentation would be
 *    appreciated but is not required.
 * 2. Altered source versions must be plainly marked as such, and must not be
 *    misrepresented as being the original software.
 * 3. This notice may not be removed or altered from any source distribution.
 *
 *****************************************************************************/
#ifndef EFR32SG23_KEYSCAN_H
#define EFR32SG23_KEYSCAN_H

#define KEYSCAN_HAS_SET_CLEAR

/**************************************************************************//**
* @addtogroup Parts
* @{
******************************************************************************/
/**************************************************************************//**
 * @defgroup EFR32SG23_KEYSCAN KEYSCAN
 * @{
 * @brief EFR32SG23 KEYSCAN Register Declaration.
 *****************************************************************************/

/** KEYSCAN Register Declaration. */
typedef struct
{
  __IM  uint32_t             IPVERSION;              /**< IPVERSION                                          */
  __IOM uint32_t             EN;                     /**< Enable                                             */
  __IOM uint32_t             SWRST;                  /**< Software Reset                                     */
  __IOM uint32_t             CFG;                    /**< Config                                             */
  __IOM uint32_t             CMD;                    /**< Command                                            */
  __IOM uint32_t             DELAY;                  /**< Delay                                              */
  __IM  uint32_t             STATUS;                 /**< Status                                             */
  __IOM uint32_t             IF;                     /**< Interrupt Flags                                    */
  __IOM uint32_t             IEN;                    /**< Interrupt Enables                                  */
        uint32_t             RESERVED0[1015U];  /**< Reserved for future use                            */
  __IM  uint32_t             IPVERSION_SET;          /**< IPVERSION                                          */
  __IOM uint32_t             EN_SET;                 /**< Enable                                             */
  __IOM uint32_t             SWRST_SET;              /**< Software Reset                                     */
  __IOM uint32_t             CFG_SET;                /**< Config                                             */
  __IOM uint32_t             CMD_SET;                /**< Command                                            */
  __IOM uint32_t             DELAY_SET;              /**< Delay                                              */
  __IM  uint32_t             STATUS_SET;             /**< Status                                             */
  __IOM uint32_t             IF_SET;                 /**< Interrupt Flags                                    */
  __IOM uint32_t             IEN_SET;                /**< Interrupt Enables                                  */
        uint32_t             RESERVED1[1015U];  /**< Reserved for future use                            */
  __IM  uint32_t             IPVERSION_CLR;          /**< IPVERSION                                          */
  __IOM uint32_t             EN_CLR;                 /**< Enable                                             */
  __IOM uint32_t             SWRST_CLR;              /**< Software Reset                                     */
  __IOM uint32_t             CFG_CLR;                /**< Config                                             */
  __IOM uint32_t             CMD_CLR;                /**< Command                                            */
  __IOM uint32_t             DELAY_CLR;              /**< Delay                                              */
  __IM  uint32_t             STATUS_CLR;             /**< Status                                             */
  __IOM uint32_t             IF_CLR;                 /**< Interrupt Flags                                    */
  __IOM uint32_t             IEN_CLR;                /**< Interrupt Enables                                  */
        uint32_t             RESERVED2[1015U];  /**< Reserved for future use                            */
  __IM  uint32_t             IPVERSION_TGL;          /**< IPVERSION                                          */
  __IOM uint32_t             EN_TGL;                 /**< Enable                                             */
  __IOM uint32_t             SWRST_TGL;              /**< Software Reset                                     */
  __IOM uint32_t             CFG_TGL;                /**< Config                                             */
  __IOM uint32_t             CMD_TGL;                /**< Command                                            */
  __IOM uint32_t             DELAY_TGL;              /**< Delay                                              */
  __IM  uint32_t             STATUS_TGL;             /**< Status                                             */
  __IOM uint32_t             IF_TGL;                 /**< Interrupt Flags                                    */
  __IOM uint32_t             IEN_TGL;                /**< Interrupt Enables                                  */
} KEYSCAN_TypeDef;
